Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd

In [17]:
pd.Series(['4','8','15','16','23','42'])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
s=[[1,2,3,4,5,6,7,8,9,10]]

In [19]:
pd.Series(s)

0    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [11]:
det=[['Name','Age','Gender'],['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]

In [20]:
pd.DataFrame(det)

        0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame is a 2-dimensional data structure that can store data of different types in rows and columns. A Series is a 1-dimensional data structure that can store data of a single type.
ex- the table formed in above question is dataframe and list represented in question2 is series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

common function to manipulate data frame :
    .read_csv
    .DataFrame
    .Series
    .to_csv()

#example
pd.read_csv("filename")

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [24]:
r1=['name','roll']
r2=['SK','26']
r3=['kk','21']
l1=pd.Series(r1)
l2=pd.Series(r2)
l3=pd.Series(r3)
pd.concat([l1,l2,l3])

0    name
1    roll
0      SK
1      26
0      kk
1      21
dtype: object